<template>
  <div class="main">
    <v-img src="../assets/train2.jpg" class="mb-4 main-image"></v-img>
    <v-row no-gutters flex-wrap>
      <v-col cols="1" md="2"> </v-col>
      <v-col cols="10" md="8">
        <v-container class="mt-6 mb-6 pa-3" elevation="3">
          <div>
            <u-animate-container>
              <u-animate
                name="fadeInDown"
                delay="0s"
                duration="3s"
                :iteration="1"
                :offset="200"
                :begin="false"
              >
                <h4>
                  يعتبر مشروع قطار المونوريل من  احد أهم المشروعات التى تنفذها وزارة
                  النقل، حيث تم تثبيته على مسار مونوريل شرق النيل (العاصمة
                  الإدارية) أمام فندق الماسة عند محطة مدينة الفنون داخل العاصمة
                  الادارية الجديدة. و يربط المشروع إقليم القاهرة الكبرى بالمناطق
                  والمدن العمرانية الجديدة شرقاً (القاهرة الجديدة - العاصمة
                  الإدارية ). ومن المقرر أن يساهم المشروع فى تيسير حركة نقل
                  الموظفين والوافدين من القاهرة والجيزة إلى القاهرة الجديدة
                  والعاصمة الإدارية لتكامله مع الخط الثالث للمترو عند محطة
                  الاستاد بمدينة نصر ومع القطار الكهربائى بمحطة مدينة الفنون
                  بالعاصمة الإدارية الجديدة.
                </h4>
              </u-animate>
            </u-animate-container>
          </div>
          <v-img
            src="../assets/train3.jpg"
            class="mt-4 mb-4"
            height="100%"
            width="100%"
          ></v-img>
          <u-animate-container>
            <u-animate
              name="fadeInDown"
              delay="0s"
              duration="3s"
              :iteration="1"
              :offset="200"
              :begin="false"
            >
              <p>
                ويعتبر المونوريل هو وسيلة نقل جماعية حديثة فهو عبارة عن قطار
                أحادى السكة يسير على كمرة خرسانية وسرعته 80 كم فى الساعة، نفس
                سرعة المترو، وينفذ في المدن متوسطة الازدحام حتى لا يؤثر على حركة
                المرور وهو وسيلة نقل حضارية سريعة صديقة للبيئة لسببين، الأول أنه
                يعمل بالكهرباء، والثاني أنه يخفف من الاختناقات المرورية ويشجع
                المواطنين على استخدام وسائل النقل العام بدلاً من سياراتهم
                الخاصة، وبالتالى الازدحام يقل واستخدام السولار والبنزين يقل
                فالانبعاثات الضارة تقل.
              </p>
            </u-animate>
          </u-animate-container>
          <u-animate-container>
            <u-animate
              name="fadeInDown"
              delay="0s"
              duration="3s"
              :iteration="1"
              :offset="200"
              :begin="false"
            >
              <p>
                بدأ ظهور المونوريل لأول مره فى انجلترا ، واليوم هو يعمل تقريبا
                في 20 دولة حول العالم كاليابان والولايات المتحدة الأمريكية
                وألمانيا والصين انضمت مصر أخيراً لنادي الدول المالكة لخطوط
                المونوريل , يكون لمشروع المونوريل فائدة كبرى على قطاعات عديدة
                كالسياحة والصناعة والزراعة والتجارة والتصدير وتعمير المدن
                الجديدة
              </p>
            </u-animate>
          </u-animate-container>
          <v-img src="../assets/train4.jpg" class="mt-4 mb-4"></v-img>
          <u-animate-container>
            <u-animate
              name="fadeInDown"
              delay="0s"
              duration="3s"
              :iteration="1"
              :offset="200"
              :begin="false"
            >
              <h4 class="mb-4">
                خلال السطور التالية ننشر أبرز المعلومات عن القطار
              </h4>
            </u-animate>
          </u-animate-container>
          <u-animate-container>
            <u-animate
              name="fadeInDown"
              delay="0s"
              duration="3s"
              :iteration="1"
              :offset="200"
              :begin="false"
            >
              <ul>
                <li>
                  1 - يعتبر إحدى وسائل النقل الأخضر الحديثة التى ستخدم الجمهورية
                  الجديدة.
                </li>
                <li>
                  2 - وصل حتى الآن القطارين الأول والثانى من عدد 40 قطارا سيتم
                  توريدها لمشروع مونوريل شرق النيل (العاصمة الإدارية).
                </li>
                <li>
                  3 - وصل القطار الأول من عدد 30 قطارا سيتم توريدها لمشروع
                  مونوريل غرب النيل (السادس من أكتوبر).
                </li>
                <li>
                  يجرى تصنيع باقى أسطول الوحدات المتحركة لمشروعى المونوريل والتى
                  ستصل تباعاً وفقاً للجدول الزمنى المحدد.
                </li>
                <li>الطول الإجمالى للمشروعين 98,5 كم بعدد 35 محطة.</li>
                <li>
                  4 - يجرى تصنيع باقى أسطول الوحدات المتحركة لمشروعى المونوريل
                  والتى ستصل تباعاً وفقاً للجدول الزمنى المحدد.
                </li>
                <li>5 - الطول الإجمالى للمشروعين 98,5 كم بعدد 35 محطة.</li>
                <li>
                  6 - تبلغ الطاقة الاستيعابية لكل خط من خطى المونوريل 600 ألف
                  راكب يومياً، ويتكون من عدد 4 عربات.
                </li>
                <li>
                  7 - من المخطط زيادة عدد العربات إلى 8 عربات مع زيادة الكثافة
                  السكانية بالمناطق العمرانية الجديدة التى يخدمها.
                </li>
              </ul>
            </u-animate>
          </u-animate-container>
          <v-img src="../assets/train5.jpg" class="mt-4 mb-4"></v-img>
          <u-animate-container>
            <u-animate
              name="fadeInDown"
              delay="0s"
              duration="3s"
              :iteration="1"
              :offset="200"
              :begin="false"
            >
              <ul class="mb-4">
                <li>
                  8 - يربط المشروع إقليم القاهرة الكبرى بالمناطق والمدن
                  العمرانية الجديدة شرقاً (القاهرة الجديدة - العاصمة الإدارية ).
                </li>
                <li>
                  9 – من المقرر أن يساهم المشروع فى تيسير حركة نقل الموظفين
                  والوافدين من القاهرة والجيزة إلى القاهرة الجديدة والعاصمة
                  الإدارية لتكامله مع الخط الثالث للمترو عند محطة الاستاد بمدينة
                  نصر ومع القطار الكهربائى بمحطة مدينة الفنون بالعاصمة الإدارية
                  الجديدة.
                </li>
                <li>
                  10 – يعتبر مشروع المونوريل من الوسائل السريعة والعصرية والآمنة
                  والصديقة للبيئة، وتوفر استهلاك الوقود، وتخفض معدلات التلوث
                  البيئى وتخفف الاختناقات المرورية بالمحاور والشوارع الرئيسية،
                  وتجذب الركاب لاستخدامها بدلاً من السيارات الخاصة.
                </li>
                <li>
                  11 - تتميز قطارات المونوريل بأنها أحادية السكة تتحرك على كمرة
                  خرسانية تعمل بدون سائق وتبلغ السرعة التصميمية لها 90كم/الساعة
                  ويصل زمن التقاطر إلى 90 ثانية.
                </li>
                <li>
                  12 - يتم تزويد القطار بكاميرات تليفزيونية بكابينة القطار
                  للمراقبة المركزية للسكة، ويوجد داخل العربات شاشات LED
                  لاستخدامها فى تزويد الركاب بمعلومات عن الرحلة أو يمكن
                  استخدامها تجارياً فى بث الاعلانات التجارية مدفوعة الأجر.
                </li>
                <li>
                  13 - يوجد أعلى الأبواب الجانبية شاشة لإعلام الركاب باسم المحطة
                  النهائية قبل استقلالهم للقطار.
                </li>
                <li>
                  14 – من المقرر أن يتم تخصيص أماكن للكراسى المتحركة الخاصة بذوى
                  الاحتياجات الخاصة مزودة بوسائل للتثبيت وكذلك تزويد العربات
                  بخرائط أعلى أبواب الركاب من الداخل تبين المسار عن طريق لمبات
                  مضيئة لمساعدة فاقدى حاسة السمع.
                </li>
              </ul>
            </u-animate>
          </u-animate-container>
        </v-container>
      </v-col>
    </v-row>
  </div>
</template>

<script>
import { UAnimateContainer, UAnimate } from "vue-wow";
export default {
  components: {
    UAnimateContainer,
    UAnimate,
  },
};
</script>
<style scoped>
@media (max-width: 440px) {
  .main-image {
    height: 220px;
    width: 100%;
  }
}
@media (min-width: 769px) {
  .main-image {
    height: 528px;
    width: 100%;
  }
}
@media (min-width: 992px) {
  .main-image {
    height: 550px;
    width: 100%;
  }
}
@media (min-width: 1025px) {
  .main-image {
    height: 720px;
    width: 100%;
  }
}

li {
  list-style: none;
}
p,
li,
h4 {
  color: gold;
}
.main {
  background-image: url("../assets/background.jpg") !important;
  background-repeat: repeat;
}
</style>
